tutorials/fluids/decayingTaylorGreenVortex/Allrun
#!/bin/bash

# This case requires PETSc to be installed
if [ -z "${PETSC_DIR}" ];
then
    echo; echo "Skipping this case as PETSc is not installed"
    echo "Please set the PETSC_DIR variable"; echo
    exit 0
fi

# Source tutorial functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions
source newtonIcoFluidScripts.sh

newtonIcoFluid::caseDoesNotRunWithFoamExtend
newtonIcoFluid::caseDoesNotRunWithOpenFOAMOrg

# Return zero when the decaying Taylor Green Vortex binaries/libraries are missing.
decayingTaylorGreenVortexNeedsBuild()
{
    if ! command -v initialiseTaylorGreenVortex >/dev/null 2>&1
    then
        return 0
    fi

    local platformsDir="${WM_PROJECT_DIR}/platforms"
    if [ ! -d "${platformsDir}" ]
    then
        return 0
    fi

    local libs=( \
        libdecayingTaylorGreenVortexFvPatchVectorField.so \
        libdecayingTaylorGreenVortexMeshMotion.so \
    )

    for lib in "${libs[@]}"
    do
        if [ -z "$(find "${platformsDir}" -maxdepth 3 -name "${lib}" -print -quit 2>/dev/null)" ]
        then
            return 0
        fi
    done

    return 1
}

# Build the utility for initialising the solution
if decayingTaylorGreenVortexNeedsBuild
then
    wmake initialiseTaylorGreenVortex

    # Build boundary condition and mesh motion libraries
    (cd src && ./Allwmake)
else
    echo "decayingTaylorGreenVortex binaries already installed; skipping rebuild"
fi

# Copy 0.orig to 0
restore0Dir

# Create the mesh
runApplication blockMesh

# Initialise the velocity and pressure initial fields with the analytical
# solutions
runApplication initialiseTaylorGreenVortex

# Run the solver
runApplication newtonIcoFoam
